[{'date': '2017-01-01',
  'description': "New Year's Day is observed on January 1, the first day of the year on the modern Gregorian calendar as well as the Julian calendar used in ancient Rome. With most countries using the Gregorian calendar as their main calendar, New Year's Day is the closest thing to being the world's only truly global public holiday, often celebrated with fireworks at the stroke of midnight as the new year starts. January 1 on the Julian calendar currently corresponds to January 14 on the Gregorian calendar, and it is on that date that followers of some of the Eastern Orthodox churches celebrate the New Year.",
  'flag_day': 1,
  'name': "New Year's Day",
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/New_Year%27s_Day'},
 {'age': 88,
  'date': '2017-01-16',
  'description': "Martin Luther King, Jr. Day is a United States federal holiday marking the birthday of Rev. Dr. Martin Luther King, Jr. It is observed on the third Monday of January each year, which is around the time of King's birthday, January 15. The floating holiday is similar to holidays set under the Uniform Monday Holiday Act, though the act predated the establishment of Martin Luther King, Jr. Day by 15 years.",
  'flag_day': 1,
  'name': 'Martin Luther King, Jr. Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Martin_Luther_King,_Jr._Day'},
 {'age': 285,
  'date': '2017-02-20',
  'description': "Washington's Birthday is a United States federal holiday celebrated on the third Monday of February in honor of George Washington, the first President of the United States. It is also commonly known as Presidents Day (sometimes spelled Presidents' Day or President's Day). As Washington's Birthday or Presidents Day, it is also the official name of a concurrent state holiday celebrated on the same day in a number of states.",
  'name': "Washington's Birthday",
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Washington%27s_Birthday'},
 {'date': '2017-04-16',
  'description': 'Easter (Old English: \\u0112ostre; Greek: \\u03a0\\u03ac\\u03c3\\u03c7\\u03b1, Paskha; Aramaic: \\u05e4\\u05b6\\u05bc\\u05e1\\u05d7\\u05d0\\u200e Pas\\u1e25a; from Hebrew: \\u05e4\\u05b6\\u05bc\\u05e1\\u05b7\\u05d7\\u200e Pesa\\u1e25) is the central feast in the Christian liturgical year. According to the Canonical gospels, Jesus rose from the dead on the third day after his crucifixion. His resurrection is celebrated on Easter Day or Easter Sunday (also Resurrection Day or Resurrection Sunday). The chronology of his death and resurrection is variously interpreted to have occurred between AD 26 and 36.',
  'name': 'Easter',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Easter'},
 {'date': '2017-04-17',
  'description': 'Easter Monday is the day after Easter Sunday and is celebrated as a holiday in some largely Christian cultures, especially Roman Catholic and Eastern Orthodox cultures. Easter Monday in the Roman Catholic liturgical calendar is the second day of the octave of Easter Week and analogously in the Eastern Orthodox Church is the second day of Bright Week.',
  'name': 'Easter Monday',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Easter_Monday'},
 {'age': 152,
  'date': '2017-05-29',
  'description': 'Memorial Day is a United States federal holiday observed annually on the last Monday of May. Formerly known as Decoration Day, it originated after the American Civil War to commemorate the fallen Union soldiers of the Civil War. (Southern ladies organizations and southern schoolchildren had decorated Confederate graves in Richmond and other cities during the Civil War, but each region had its own date. Most dates were in May.) By the 20th century Memorial Day had been extended to honor all Americans who have died in all wars. Memorial Day is a day of remembering the men and women who died while serving in the United States Armed Forces. As a marker it typically marks the start of the summer vacation season, while Labor Day marks its end.',
  'flag_day': 1,
  'name': 'Memorial Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Memorial_Day'},
 {'age': 241,
  'alternate_names': 'Fourth of July',
  'date': '2017-07-04',
  'description': 'Independence Day, commonly known as the Fourth of July, is a federal holiday in the United States commemorating the adoption of the Declaration of Independence on July 4, 1776, declaring independence from the Kingdom of Great Britain. Independence Day is commonly associated with fireworks, parades, barbecues, carnivals, fairs, picnics, concerts, baseball games, family reunions, and political speeches and ceremonies, in addition to various other public and private events celebrating the history, government, and traditions of the United States. Independence Day is the national day of the United States.',
  'flag_day': 1,
  'name': 'Independence Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Independence_Day_(US)'},
 {'age': 135,
  'date': '2017-09-04',
  'description': 'Labor Day is a United States federal holiday observed on the first Monday in September that celebrates the economic and social contributions of workers.',
  'flag_day': 1,
  'name': 'Labor Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Labor_Day'},
 {'age': 525,
  'date': '2017-10-09',
  'description': "Many countries in the New World and elsewhere celebrate the anniversary of Christopher Columbus's arrival in the Americas, which occurred on October 12, 1492, as an official holiday.",
  'flag_day': 1,
  'name': 'Columbus Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Columbus_Day'},
 {'age': 99,
  'date': '2017-11-11',
  'description': 'Veterans Day, formerly Armistice Day, is an annual United States holiday honoring armed service veterans. It is a federal holiday that is observed on November 11. It coincides with other holidays such as Armistice Day or Remembrance Day, which are celebrated in other parts of the world and also mark the anniversary of the signing of the Armistice that ended World War I. (Major hostilities of World War I were formally ended at the 11th hour of the 11th day of the 11th month of 1918 with the German signing of the Armistice.)',
  'flag_day': 1,
  'name': 'Veterans Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Veterans_Day'},
 {'age': 154,
  'date': '2017-11-23',
  'description': 'Thanksgiving, or Thanksgiving Day, is a holiday celebrated in the United States on the fourth Thursday in November. It has officially been an annual tradition since 1863, when, during the Civil War, President Abraham Lincoln proclaimed a national day of "Thanksgiving and Praise to our beneficent Father who dwelleth in the Heavens", to be celebrated on Thursday, November 26. As a federal and popular holiday in the U.S., Thanksgiving is one of the major holidays of the year. Together with Christmas and the New Year, Thanksgiving is a part of the broader holiday season.',
  'flag_day': 1,
  'name': 'Thanksgiving Day',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Thanksgiving_(United_States)'},
 {'date': '2017-12-25',
  'description': 'Christmas or Christmas Day (Old English: Cr\\u012bstesm\\u00e6sse, literally "Christ\'s mass") is an annual commemoration of the birth of Jesus Christ, celebrated generally on December 25 as a religious and cultural holiday by billions of people around the world. A feast central to the Christian liturgical year, it closes the Advent season and initiates the twelve days of Christmastide. Christmas is a civil holiday in many of the world\'s nations, is celebrated by an increasing number of non-Christians, and is an integral part of the Christmas and holiday season.',
  'name': 'Christmas',
  'url': 'https:\\/\\/en.wikipedia.org\\/wiki\\/Christmas'}]
